---
kind: enumMember
id: F:Autodesk.Revit.DB.Visual.MetalPatternType.Custom
enum: Autodesk.Revit.DB.Visual.MetalPatternType
source: html/1e3be6a2-dc4f-4fb0-29bf-5c4924ca664d.htm
---
# Autodesk.Revit.DB.Visual.MetalPatternType.Custom